md848-cornell/NRF-ROKIX-sensor-mesh/firmware/nrf5SDKforMeshv310src/examples/light_switch44/provisioner/src/node_setup.c
            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }

         /* Bind the bsense server to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_bsense:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: bsense server\n");
            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NONE;
            model_id.model_id = bsense_SERVER_MODEL_ID;
            uint16_t element_address = m_current_node_addr;
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "BS: element address: %d\n", element_address);
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "BS: m appkey index: %d\n", m_appkey_idx);
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "BS: model id: %d\n", model_id);
            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }

        /* Bind the On/Off server to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: 0x%04x server\n", m_server_model_id.model_id);
            access_model_id_t model_id;
            model_id.company_id = m_server_model_id.company_id;
            model_id.model_id = m_server_model_id.model_id;
            uint16_t element_address = m_current_node_addr;

            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Server m_appkey_idx: %d\n", m_appkey_idx);
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Server model_id: %x\n", model_id);

            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }

        /* Bind the On/Off client to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT:
        {
            if (model_element_addr == 0)
            {
                model_element_addr = m_current_node_addr+1;
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: setting model_element_addr: %d\n", model_element_addr);
            }
            
            //#define bsense_CLIENT_MODEL_ID 0x1001

            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: 0x%04x client on element 0x%04x\n", m_client_model_id.model_id, model_element_addr);

            access_model_id_t model_id;
            model_id.company_id = m_client_model_id.company_id;
            model_id.model_id = m_client_model_id.model_id;
            uint16_t element_address = model_element_addr;

            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Client m_appkey_idx: %d\n", m_appkey_idx);
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Client m_appkey_idx: %x\n", model_id);

            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);
             __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "(M) Status : %d\n", status);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, ARRAY_SIZE(exp_status), exp_status);

            if (status == NRF_SUCCESS)
            {
                model_element_addr++;
            }
            break;
        }

        /* Configure the publication parameters for the Health server: */
        case NODE_SETUP_CONFIG_PUBLICATION_HEALTH:
        {
            config_publication_state_t pubstate = {0};
            pubstate.element_address = m_current_node_addr;
            pubstate.publish_address.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
            pubstate.publish_address.value = PROVISIONER_ADDRESS;
            pubstate.appkey_index = 0;
            pubstate.frendship_credential_flag = false;
            pubstate.publish_ttl = (SERVER_NODE_COUNT > NRF_MESH_TTL_MAX ? NRF_MESH_TTL_MAX : SERVER_NODE_COUNT);
            pubstate.publish_period.step_num = 1;
            pubstate.publish_period.step_res = ACCESS_PUBLISH_RESOLUTION_10S;
            pubstate.retransmit_count = 1;
            pubstate.retransmit_interval = 0;
            pubstate.model_id.company_id = ACCESS_COMPANY_ID_NONE;
            pubstate.model_id.model_id = HEALTH_SERVER_MODEL_ID;
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Setting publication address for the health server to 0x%04x\n", pubstate.publish_address.value);
            status = config_client_model_publication_set(&pubstate);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }

        /* Configure the publication parameters for the bsense server: */
        case NODE_SETUP_CONFIG_PUBLICATION_bsense:
        {
            config_publication_state_t pubstate = {0};
            pubstate.element_address = m_current_node_addr;

            pubstate.publish_address.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
            pubstate.publish_address.value = PROVISIONER_ADDRESS;
            pubstate.appkey_index = 0;
            pubstate.frendship_credential_flag = false;
            pubstate.publish_ttl = (SERVER_NODE_COUNT > NRF_MESH_TTL_MAX ? NRF_MESH_TTL_MAX : SERVER_NODE_COUNT);

            pubstate.publish_period.step_num = 2;
            pubstate.publish_period.step_res = ACCESS_PUBLISH_RESOLUTION_1S;

            pubstate.retransmit_count = 0;
            pubstate.retransmit_interval = 0;

            pubstate.model_id.company_id = ACCESS_COMPANY_ID_NONE;
            pubstate.model_id.model_id = bsense_SERVER_MODEL_ID;
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Setting publication address for the bsense server to 0x%04x\n", pubstate.publish_address.value);
            status = config_client_model_publication_set(&pubstate);

